---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.CanInsertColumn(System.Int32)
source: html/b5b8bb65-ec32-3cf1-ed6d-21ce589f185c.htm
---
# Autodesk.Revit.DB.TableSectionData.CanInsertColumn Method

Verifies if a new column can be inserted at the given index.

## Syntax (C#)
```csharp
public bool CanInsertColumn(
	int nIndex
)
```

## Parameters
- **nIndex** (`System.Int32`) - An integer index.

## Returns
True if the column can be inserted, false otherwise.